In [1]:
import numpy as np
import pandas as pd
from sqlalchemy import create_engine

# Connect to my postgresql database
# my user_name: postgres
# password: postgres_password
# database name: my_db

conn_url = 'postgresql://postgres:postgres_password@localhost:5432/sql_project'
engine = create_engine(conn_url)
connection = engine.connect()

In [2]:
df_store_location = pd.read_csv('tj-locations.csv')
df_store_location.head()

,name,latitude,longitude,street,city,state,zip,phone,website
0,Trader Joe's Palm Desert (3),33.727460,-116.396611,44250 Town Center Way,Palm Desert,CA,92260,760-340-2291,https://locations.traderjoes.com/ca/palm-deser...
1,Trader Joe's La Habra,33.918690,-117.969015,"2101 W. Imperial Hwy, Suite A",La Habra,CA,90631,562-266-1428,https://locations.traderjoes.com/ca/la-habra/5/
2,Trader Joe's Oceanside (22),33.183906,-117.333506,2570 Vista Way,Oceanside,CA,92054,760-433-9994,https://locations.traderjoes.com/ca/oceanside/22/
3,Trader Joe's San Ramon (246),37.764165,-121.952108,300 Market Place,San Ramon,CA,94583,925-275-8140,https://locations.traderjoes.com/ca/san-ramon/...
4,Trader Joe's Rocklin (228),38.802870,-121.209243,5116 Commons Dr. #103,Rocklin,CA,95677,916-660-9820,https://locations.traderjoes.com/ca/rocklin/228/

### Table - store location

In [3]:
df_store_location['store_id'] = range(1, len(df_store_location) + 1)
df_store_location = df_store_location[df_store_location['store_id'] <= 150]
df_store_location

,name,latitude,longitude,street,city,state,zip,phone,website,store_id
0,Trader Joe's Palm Desert (3),33.727460,-116.396611,44250 Town Center Way,Palm Desert,CA,92260,760-340-2291,https://locations.traderjoes.com/ca/palm-deser...,1
1,Trader Joe's La Habra,33.918690,-117.969015,"2101 W. Imperial Hwy, Suite A",La Habra,CA,90631,562-266-1428,https://locations.traderjoes.com/ca/la-habra/5/,2
2,Trader Joe's Oceanside (22),33.183906,-117.333506,2570 Vista Way,Oceanside,CA,92054,760-433-9994,https://locations.traderjoes.com/ca/oceanside/22/,3
3,Trader Joe's San Ramon (246),37.764165,-121.952108,300 Market Place,San Ramon,CA,94583,925-275-8140,https://locations.traderjoes.com/ca/san-ramon/...,4
4,Trader Joe's Rocklin (228),38.802870,-121.209243,5116 Commons Dr. #103,Rocklin,CA,95677,916-660-9820,https://locations.traderjoes.com/ca/rocklin/228/,5
...,...,...,...,...,...,...,...,...,...,...
145,Trader Joe's Sacramento (175),38.560395,-121.444814,5000 Folsom Blvd,Sacramento,CA,95819,916-456-1853,https://locations.traderjoes.com/ca/sacramento...,146
146,Trader Joe's Fremont (77),37.543468,-121.986152,39324 Argonaut Way,Fremont,CA,94538,510-794-1386,https://locations.traderjoes.com/ca/fremont/77/,147
147,Trader Joe's Santa Cruz (193),36.974544,-122.024698,700 Front St,Santa Cruz,CA,95060,831-425-0140,https://locations.traderjoes.com/ca/santa-cruz...,148
148,Trader Joe's Rancho Palos Verdes (233),33.749330,-118.406680,31176 Hawthorne Blvd,Rancho Palos Verdes,CA,90275,310-544-1727,https://locations.traderjoes.com/ca/rancho-pal...,149
149,Trader Joe's Rancho Palos Verdes - S. Western ...,33.756516,-118.311651,28901 S Western Ave,Rancho Palos Verdes,CA,90275,310-832-1241,https://locations.traderjoes.com/ca/rancho-pal...,150

In [4]:
max_lengths = df_store_location.applymap(lambda x: len(str(x)) if isinstance(x, str) else 0).max()
max_lengths

name         55
latitude      0
longitude     0
street       34
city         22
state         2
zip           0
phone        12
website      62
store_id      0
dtype: int64

In [5]:
# Insert extracted data into departments table

table_name = "store_location"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

df_store_location.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

150

In [6]:
df_storesdata = pd.read_excel("StoresData.xlsx")
df_storesdata

,Store No.,Sales $m,Wages $m,No. Staff,Location,Loc'n (Num),State,State (Num),Age (Yrs),GrossProfit,...,Mng-Sex (Num),Mng-Age,Mng-Exp,Mng-Train,Union%,Car Spaces,HomeDel,HomeDel (Num),Basket:2013,Basket:2014
0,1,12.5,2.3,60,Mall,2,NSW,1,10,0.712,...,0,33,12,2,38,46,Del:No,0,171,178
1,2,14.5,2.7,69,Mall,2,Vic,2,8,0.091,...,0,33,16,1,38,73,Del:No,0,168,178
2,3,19.0,3.1,79,Country,3,Vic,2,7,1.075,...,0,30,9,2,39,64,Del:No,0,180,188
3,4,18.2,2.6,66,Mall,2,Qld,3,7,1.372,...,0,29,9,2,38,66,Del:Yes,1,173,180
4,5,7.6,2.0,51,Strip,1,Qld,3,15,2.148,...,0,36,4,3,40,29,Del:No,0,166,171
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145,146,14.1,3.3,88,Strip,1,SA,4,5,0.504,...,1,42,9,3,35,63,Del:No,0,163,172
146,147,8.1,1.7,58,Country,3,NSW,1,19,0.447,...,0,43,12,3,42,35,Del:No,0,178,186
147,148,13.6,2.9,66,Strip,1,WA,5,17,2.620,...,0,39,8,3,45,48,Del:No,0,166,172
148,149,10.0,2.0,55,Mall,2,WA,5,8,1.168,...,0,52,13,3,40,34,Del:No,0,174,182
149,150,11.6,2.2,60,Country,3,ACT,8,9,0.032,...,0,35,8,2,39,37,Del:Yes,1,178,185

### Table - Location_type

In [7]:
df_location_type = df_storesdata[['Location', "Loc'n (Num)"]].drop_duplicates()

explanations = ['Large complex or shopping center or mall in a major town or city',
                'Town of 20,000 or fewer inhabitants',
                'typical street shopping centre in a major town or city']

df_location_type = df_location_type.rename(columns={"Location": "type_name", "Loc'n (Num)": "type_id"})
df_location_type['explanation'] = explanations
df_location_type

  type_name  type_id                                        explanation
0      Mall        2  Large complex or shopping center or mall in a ...
2   Country        3                Town of 20,000 or fewer inhabitants
4     Strip        1  typical street shopping centre in a major town...

In [8]:
max_lengths = df_location_type.applymap(lambda x: len(str(x)) if isinstance(x, str) else 0).max()
max_lengths

type_name       7
type_id         0
explanation    64
dtype: int64

In [9]:
# Insert extracted data into departments table

table_name = "location_type"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

df_location_type.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

3

### Table - store_labor

In [10]:
df_store_labor = df_storesdata[['Store No.', 'Wages $m', 'No. Staff']]
df_store_labor = df_store_labor.rename(columns={"Store No.": "store_id", "Wages $m": "total_wages_m", "No. Staff": "number_of_staffs"})
df_store_labor['avg_wage_k'] = df_store_labor["total_wages_m"] / df_store_labor["number_of_staffs"] * 1000
df_store_labor

     store_id  total_wages_m  number_of_staffs  avg_wage_k
0           1            2.3                60   38.333333
1           2            2.7                69   39.130435
2           3            3.1                79   39.240506
3           4            2.6                66   39.393939
4           5            2.0                51   39.215686
..        ...            ...               ...         ...
145       146            3.3                88   37.500000
146       147            1.7                58   29.310345
147       148            2.9                66   43.939394
148       149            2.0                55   36.363636
149       150            2.2                60   36.666667

[150 rows x 4 columns]

In [11]:
# Insert extracted data into departments table

table_name = "store_labor_cost"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

df_store_labor.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

150

### Table - Employees

In [12]:
df_employees = df_storesdata[['Mng-Sex', 'Mng-Sex (Num)', 'Mng-Age', 'Mng-Exp', 'Mng-Train']].drop_duplicates()
df_employees = df_employees.rename(columns={"Mng-Sex": "sex", "Mng-Sex (Num)": "sex_indicator", 
                                            "Mng-Age": "age", "Mng-Exp": "years_of_experience",
                                            "Mng-Train" : "num_of_training"})
df_employees = df_employees.sort_values("years_of_experience", ascending = False)
df_employees['employee_id'] = range(1, len(df_employees) + 1)
df_employees

,sex,sex_indicator,age,years_of_experience,num_of_training,employee_id
11,Male,0,39,21,5,1
74,Male,0,40,20,2,2
136,Male,0,49,19,3,3
57,Male,0,34,19,1,4
95,Male,0,36,18,1,5
...,...,...,...,...,...,...
49,Male,0,35,1,3,132
90,Male,0,46,1,4,133
132,Male,0,40,1,6,134
39,Male,0,28,1,6,135
100,Male,0,33,1,3,136

In [13]:
# Insert extracted data into departments table

table_name = "employees"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

df_employees.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

136

### Table - Store_Manager
#### One employee could manage more than one store.

In [14]:
stores = df_storesdata[['Store No.', 'Mng-Sex', 'Mng-Sex (Num)', 'Mng-Age', 'Mng-Exp', 'Mng-Train']]
stores = stores.rename(columns={'Store No.': "store_id", "Mng-Sex": "sex", 
                                "Mng-Sex (Num)": "sex_indicator", "Mng-Age": "age", 
                                "Mng-Exp": "years_of_experience", "Mng-Train" : "num_of_training"})

df_store_manager = pd.merge(stores, df_employees, on=['sex', 'age', 'years_of_experience', 'num_of_training'], how='left')[['store_id', 'employee_id']]
df_store_manager = df_store_manager.rename(columns={'employee_id': "manager_id"})
df_store_manager

     store_id  manager_id
0           1          37
1           2           8
2           3          71
3           4          66
4           5         123
..        ...         ...
145       146          65
146       147          35
147       148          80
148       149          21
149       150          90

[150 rows x 2 columns]

In [15]:
# Insert extracted data into departments table

table_name = "store_management"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

df_store_manager.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

150

### Table - Stores(150)

In [16]:
df_stores = df_storesdata[['Store No.', "Loc'n (Num)", 'Age (Yrs)', 'Sales $m', 'GrossProfit', "Adv.$'000"]]
df_stores = df_stores.rename(columns={'Store No.': "store_id", "Loc'n (Num)": "location_type_id", 
                                       "Age (Yrs)": "store_age_years", "Sales $m": "sales_m",
                                       "GrossProfit": "gross_profit", "Adv.$'000": "ads_expense_k"})
df_stores

,store_id,location_type_id,store_age_years,sales_m,gross_profit,ads_expense_k
0,1,2,10,12.5,0.712,171
1,2,2,8,14.5,0.091,213
2,3,3,7,19.0,1.075,255
3,4,2,7,18.2,1.372,287
4,5,1,15,7.6,2.148,112
...,...,...,...,...,...,...
145,146,1,5,14.1,0.504,253
146,147,3,19,8.1,0.447,20
147,148,1,17,13.6,2.620,103
148,149,2,8,10.0,1.168,120
149,150,3,9,11.6,0.032,102

In [17]:
max_lengths = df_stores.applymap(lambda x: len(str(x)) if isinstance(x, str) else 0).max()
max_lengths

store_id            0
location_type_id    0
store_age_years     0
sales_m             0
gross_profit        0
ads_expense_k       0
dtype: int64

In [18]:
# Insert extracted data into departments table

table_name = "store"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

df_stores.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

150

### Table - customer

In [19]:
df_customer = pd.read_csv("customer.csv", sep='\t')
df_customer

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [20]:
df_customer.rename(columns={
    'Year_Birth': 'year_of_birth',
    'Education': 'education',
    'Marital_Status': 'marital_status',
    'Income': 'income',
    'Dt_Customer': 'dt_customer'
}, inplace=True)
df_customer['customer_id'] = range(1, len(df_customer) + 1)
df_customer = df_customer[['customer_id', 'year_of_birth', 'education', 'marital_status', 'income', 'dt_customer']]
df_customer['dt_customer'] = pd.to_datetime(df_customer['dt_customer'],  format='%d-%m-%Y')
df_customer

/var/folders/z4/7v0t35v53bq1ggx1xbczbl300000gn/T/ipykernel_40936/168262581.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_customer['dt_customer'] = pd.to_datetime(df_customer['dt_customer'],  format='%d-%m-%Y')

,customer_id,year_of_birth,education,marital_status,income,dt_customer
0,1,1957,Graduation,Single,58138.0,2012-09-04
1,2,1954,Graduation,Single,46344.0,2014-03-08
2,3,1965,Graduation,Together,71613.0,2013-08-21
3,4,1984,Graduation,Together,26646.0,2014-02-10
4,5,1981,PhD,Married,58293.0,2014-01-19
...,...,...,...,...,...,...
2235,2236,1967,Graduation,Married,61223.0,2013-06-13
2236,2237,1946,PhD,Together,64014.0,2014-06-10
2237,2238,1981,Graduation,Divorced,56981.0,2014-01-25
2238,2239,1956,Master,Together,69245.0,2014-01-24
2239,2240,1954,PhD,Married,52869.0,2012-10-15

In [21]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     2240 non-null   int64
 1   year_of_birth   2240 non-null   int64
 2   education       2240 non-null   object
 3   marital_status  2240 non-null   object
 4   income          2216 non-null   float64
 5   dt_customer     2240 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 105.1+ KB

In [22]:
max_lengths = df_customer.applymap(lambda x: len(str(x)) if isinstance(x, str) else 0).max()
max_lengths

customer_id        0
year_of_birth      0
education         10
marital_status     8
income             0
dt_customer        0
dtype: int64

In [23]:
# Insert extracted data into departments table

table_name = "customer"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

df_customer.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

240

### Table - product lines

In [25]:
supermarket = pd.read_csv('supermarket.csv')
supermarket.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

In [26]:
supermarket.rename(columns={'Product line': 'product_line', 'Unit price': 'unit_price'}, inplace=True)
unique_product_lines = supermarket['product_line'].unique()
df_product_line = pd.DataFrame({
    'product_line_id': range(1, len(unique_product_lines) + 1),
    'product_line_name': unique_product_lines
})
df_product_line

   product_line_id       product_line_name
0                1       Health and beauty
1                2  Electronic accessories
2                3      Home and lifestyle
3                4       Sports and travel
4                5      Food and beverages
5                6     Fashion accessories

In [27]:
# Insert extracted data into departments table

table_name = "product_line"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

df_product_line.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

6

### Table - product

In [28]:
unique_combinations = supermarket[['product_line', 'unit_price']].drop_duplicates()
unique_combinations = unique_combinations.sort_values(by='product_line').reset_index(drop=True)
unique_combinations['product_id'] = unique_combinations.index+1

unique_combinations

               product_line  unit_price  product_id
0    Electronic accessories       63.22           1
1    Electronic accessories       83.08           2
2    Electronic accessories       20.85           3
3    Electronic accessories       52.89           4
4    Electronic accessories       74.51           5
..                      ...         ...         ...
988       Sports and travel       23.01         989
989       Sports and travel       83.06         990
990       Sports and travel       48.91         991
991       Sports and travel       37.02         992
992       Sports and travel       29.61         993

[993 rows x 3 columns]

In [29]:
product_line_counts = unique_combinations['product_line'].value_counts()
product_line_counts

Fashion accessories       176
Food and beverages        174
Electronic accessories    168
Sports and travel         165
Home and lifestyle        158
Health and beauty         152
Name: product_line, dtype: int64

In [30]:
fashion_accessories_names = np.array([
    'Chic Charm Necklace', 'Elegant Pearl Bracelet', 'Vintage Leather Handbag',
    'Fashionable Sunglasses', 'Stylish Fedora Hat', 'Sparkling Crystal Earrings',
    'Boho Beaded Anklet', 'Trendy Velvet Choker', 'Luxury Silk Scarf',
    'Statement Hoop Earrings', 'Classic Leather Belt', 'Designer Cuff Bracelet',
    'Retro Round Sunglasses', 'Funky Printed Backpack', 'Chunky Knit Beanie',
    'Charm Bracelet Set', 'Modern Geometric Necklace', 'Embroidered Clutch',
    'Straw Wide Brim Hat', 'Layered Boho Rings', 'Leopard Print Tote Bag',
    'Cufflinks and Tie Set', 'Chandelier Drop Earrings', 'Quilted Crossbody Purse',
    'Glamorous Rhinestone Headband', 'Denim Patchwork Bucket Hat',
    'Feather Statement Necklace', 'Suede Fringe Handbag', 'Floral Print Scarf',
    'Crystal-Studded Hair Clip', 'Sleek Minimalist Watch', 'Faux Fur Collar',
    'Oversized Aviator Sunglasses', 'Beaded Tassel Earrings', 'Embellished Beret',
    'Pearl and Chain Anklet', 'Leather Wrap Bracelet', 'Embroidered Velvet Gloves',
    'Rustic Woven Belt', 'Sequin Party Clutch', 'Velvet Hair Scrunchie',
    'Wooden Bead Necklace', 'Embossed Leather Wallet', 'Enamel Pin Set',
    'Tassel Trimmed Kimono', 'Chunky Platform Sandals', 'Patterned Silk Pocket Square',
    'Braided Leather Headband', 'Metallic Ankle Boots', 'Printed Silk Scarf',
    'Oversized Statement Ring', 'Camo Print Utility Backpack', 'Bamboo Hoop Earrings',
    'Crystal-Embellished Belt', 'Felt Floppy Hat', 'Bohemian Coin Anklet',
    'Silk Bow Tie', 'Ruffled Lace Parasol', 'Satin Opera Gloves',
    'Faux Pearl Hair Comb', 'Embellished Velvet Loafers', 'Tribal Print Duffle Bag',
    'Leopard Print Fedora', 'Seashell Charm Bracelet', 'Studded Leather Cuff',
    'Fringe Trimmed Poncho', 'Printed Canvas Sneakers', 'Retro Cat Eye Glasses',
    'Suede Ankle Booties', 'Layered Lace Choker', 'Embossed Metal Cigarette Case',
    'Corduroy Newsboy Cap', 'Oversized Woven Tote', 'Beaded Fringe Earrings',
    'Cheetah Print Belt', 'Felt Cloche Hat', 'Cotton Bandana Set',
    'Oversized Chain Link Necklace', 'Embellished Velvet Flats', 'Faux Leather Leggings',
    'Embroidered Velvet Backpack', 'Lariat Chain Necklace', 'Wool Blend Beret',
    'Glittering Sequin Clutch', 'Holographic Fanny Pack', 'Lace-Up Corset Belt',
    'Chunky Knit Infinity Scarf', 'Embellished Sunglasses', 'Braided Leather Sandals',
    'Fringe Detail Satchel', 'Gold Plated Cuff Bracelet', 'Velvet Bow Hair Tie',
    'Geometric Patterned Tie', 'Rhinestone Fishnet Gloves', 'Rustic Wooden Bead Bracelet',
    'Studded Leather Harness', 'Crystal Tassel Necklace', 'Straw Visor Hat',
    'Embossed Velvet Crossbody Bag', 'Boho Feather Headpiece', 'Leopard Print Scarf',
    'Braided Suede Belt', 'Bamboo Handle Clutch', 'Faux Fur Trimmed Booties',
    'Metallic Threaded Shawl', 'Embellished Lace-Up Boots', 'Oversized Round Sunglasses',
    'Fringe Trimmed Kimono', 'Corduroy Baker Boy Hat', 'Tribal Print Canvas Backpack',
    'Sequin Embellished Tights', 'Layered Gold Coin Necklace', 'Studded Leather Gloves',
    'Leopard Print Bandana', 'Velvet Padded Headband', 'Oversized Plaid Blanket Scarf',
    'Lace-Up Gladiator Sandals', 'Crystal Embellished Velvet Belt', 'Statement Collar Necklace',
    'Embossed Leather Card Holder', 'Faux Fur Stole', 'Printed Neckerchief',
    'Chunky Cable Knit Beanie', 'Rhinestone Embellished Hoop Earrings', 'Printed Suede Booties',
    'Embellished Wool Fedora', 'Tassel Detail Shoulder Bag', 'Crystal Drop Choker',
    'Satin Bow Ankle Socks', 'Leopard Print Hair Scrunchie', 'Fringe Detail Moccasins',
    'Retro Enamel Pin Set', 'Embossed Crocodile Belt', 'Boho Beaded Headband',
    'Woven Straw Clutch', 'Metallic Thread Embroidered Scarf', 'Leather Driving Gloves',
    'Oversized Aviator Sunglasses', 'Embellished Velvet Mules', 'Beaded Fringe Crossbody Bag',
    'Chain Link Statement Bracelet', 'Embroidered Velvet Kimono', 'Chunky Block Heel Boots',
    'Crystal Encrusted Hair Pins', 'Quilted Leather Shoulder Bag', 'Braided Jute Belt',
    'Printed Silk Sleep Mask', 'Fringe Trimmed Western Boots', 'Embellished Cat Eye Glasses',
    'Cotton Blend Headscarf', 'Rhinestone Embellished Fishnet Socks', 'Leather Buckle Bracelet'
])
additional_fashion_accessories_names = np.array([
    'Metallic Clutch Purse', 'Printed Satin Scarf', 'Leather Wristlet', 'Retro Cat Eye Sunglasses',
    'Embellished Hair Bun Holder', 'Faux Leather Belt Bag', 'Braided Chain Bracelet', 'Velvet Hair Bow',
    'Lace Patterned Tights', 'Suede Over-the-Knee Boots', 'Geometric Patterned Headband', 'Beaded Fringe Belt',
    'Rhinestone Brooch Pin', 'Denim Patchwork Crossbody', 'Corduroy Bucket Hat', 'Knitted Fingerless Gloves',
    'Faux Fur-lined Boot Socks', 'Studded Leather Collar', 'Oversized Wool Poncho', 'Embroidered Velvet Ballet Flats',
    'Chain Link Anklet', 'Sequin Embellished Beret', 'Felt Fedora with Ribbon Band', 'Crystal Embellished Hair Pin'
])

fashion_accessories_names = np.concatenate([fashion_accessories_names, additional_fashion_accessories_names])

In [31]:
food_beverages_names = np.array([
    'Organic Quinoa', 'Artisanal Sourdough Bread', 'Cold-Pressed Green Juice',
    'Extra Virgin Olive Oil', 'Gourmet Dark Chocolate', 'Locally Roasted Coffee Beans',
    'Himalayan Pink Salt', 'Wildflower Honey', 'Handcrafted Pasta Sauce',
    'Craft IPA Beer', 'Grass-Fed Beef Jerky', 'Premium Jasmine Rice',
    'Aged Balsamic Vinegar', 'Truffle Infused Olive Oil', 'Farm Fresh Eggs',
    'Chia Seed Pudding', 'Kombucha Sampler Pack', 'Imported Parmesan Cheese',
    'Small-Batch Bourbon', 'Hand-Picked Blueberries', 'Golden Turmeric Latte Mix',
    'Raw Almond Butter', 'Artisan Cheese Platter', 'Organic Spinach and Kale Blend',
    'Prosciutto Di Parma', 'Crispy Sea Salted Kale Chips', 'Sparkling Mineral Water',
    'Whole Grain Granola', 'Ethically Sourced Cacao Nibs', 'Gourmet Maple Syrup',
    'Ahi Tuna Poke Bowl', 'Sustainably Caught Salmon Fillets', 'Organic Avocado Oil',
    'Spicy Sriracha Sauce', 'Hand-Roasted Cashews', 'Cherrywood Smoked Sea Salt',
    'French Roast Coffee Blend', 'Farmhouse Cheddar Cheese', 'Matcha Green Tea Powder',
    'Handmade Truffle Fettuccine', 'Artisanal Pesto Sauce', 'Craft Gin Distilled Locally',
    'Hand-Crafted Artisan Chocolate Bar', 'Local Honeycrisp Apples', 'Freshly Baked Croissants',
    'Organic Greek Yogurt', 'Ginger Turmeric Immunity Shots', 'Artisanal Charcuterie Board',
    'Aged Gouda Cheese', 'Organic Arugula Salad Mix', 'Classic Margherita Pizza',
    'Crisp Fuji Apple Cider', 'Hand-Selected Acai Berries', 'Small-Batch Barrel-Aged Whiskey',
    'Balsamic Glazed Brussels Sprouts', 'Heirloom Tomato Bruschetta', 'Crafted Root Beer',
    'Sun-Dried Tomato and Olive Tapenade', 'Quattro Formaggi Ravioli', 'Gourmet Pecan Pie',
    'Sustainably Harvested Alaskan Salmon', 'Cherry Blossom Green Tea',
    'Smoked Paprika Infused Olive Oil', 'Organic Free-Range Chicken Eggs',
    'Hand-Rolled Sushi Rolls', 'Local Artisanal Goat Cheese', 'Black Truffle Risotto',
    'Crafted Cinnamon Apple Cider', 'Wild-Caught Jumbo Shrimp', 'Authentic Indian Basmati Rice',
    'Lemon Zest Infused Extra Virgin Olive Oil', 'Blueberry Acai Smoothie Bowl Mix',
    'Artisanal Bacon Jam', 'Farm Fresh Organic Kale', 'Handmade Ravioli Sampler',
    'Single-Origin Fair Trade Coffee Beans', 'Cajun Style Smoked Andouille Sausage',
    'Organic Superfood Trail Mix', 'Roasted Red Pepper Hummus', 'Gourmet Wild Mushroom Risotto',
    'Artisanal Raspberry Balsamic Reduction', 'Locally Brewed Craft Pale Ale',
    'Hand-Selected Raspberry Jam', 'Hand-Picked Mango Salsa', 'Authentic Italian Prosciutto',
    'Ginger Lime Infused Sparkling Water', 'Truffle Macaroni and Cheese', 'Crafted Irish Stout',
    'Wild-Caught Alaskan King Crab Legs', 'Handmade Garlic Knots', 'Organic Quinoa Flour',
    'Handcrafted Lavender Infused Honey', 'Smoked Salmon and Cream Cheese Bagels',
    'Farm Fresh Artichokes', 'Authentic Japanese Miso Soup', 'Gourmet Aged Cheddar Popcorn',
    'Chardonnay Barrel-Aged Sauvignon Blanc', 'Bourbon Barrel Smoked Sea Salt',
    'Hand-Rolled Chocolate Truffles', 'Honey Dijon Glazed Chicken Wings',
    'Organic Apple Cider Vinegar', 'Sundried Tomato and Basil Pesto',
    'Jamaican Blue Mountain Coffee Blend', 'Artisanal Fig and Olive Tapenade',
    'Crafted Pumpkin Spice Latte Mix', 'Handcrafted Italian Cannoli', 'Organic Black Quinoa',
    'Locally Harvested Honeycomb', 'Gourmet Truffle Popcorn', 'Crispy Garlic Parmesan Kale Chips',
    'Small-Batch Distilled Vodka', 'Handmade Raspberry Almond Tarts', 'Protein-Packed Lentils',
    'Artisanal Gouda and Fig Jam Crostini', 'Smoked Salmon Benedict Brunch Kit',
    'Truffle Butter Infused Popcorn', 'Hand-Rolled Arancini Balls', 'Organic Pomegranate Juice',
    'Crafted Elderflower Tonic Water', 'Balsamic Glazed Portobello Mushrooms',
    'Hand-Poured Soy Wax Citrus Candle', 'French Vanilla Bean Infused Simple Syrup',
    'Authentic Spanish Paella Kit', 'Gourmet Black Truffle Risotto', 'Crafted Moscow Mule Mixer',
    'Locally Roasted Ethiopian Yirgacheffe Coffee Beans', 'Artisanal Sun-Dried Tomato Focaccia',
    'Handcrafted Strawberry Balsamic Jam', 'Tropical Mango Habanero Hot Sauce',
    'Roasted Garlic and Parmesan Ciabatta', 'Prosciutto-Wrapped Asparagus Spears',
    'Organic Wildflower Honey Infused Mustard', 'Crafted Hefeweizen Wheat Beer',
    'Handmade Chocolate Covered Espresso Beans', 'Authentic Mexican Mole Sauce',
    'Mango Coconut Chia Seed Pudding', 'Organic Chia Seed Energy Bars',
    'Handmade Pistachio Macarons', 'Sustainably Harvested Atlantic Cod Fillets',
    'Lemon Lavender Infused Simple Syrup', 'Artisanal Fig and Walnut Bread',
    'Honey Mustard Glazed Quinoa Meatballs', 'Crafted Dark Chocolate Raspberry Tart',
    'Authentic New York Style Bagels', 'Hand-Rolled Spinach and Feta Spanakopita',
    'Locally Sourced Wildflower Honey', 'Handcrafted Hazelnut Praline Gelato',
    'Organic Acacia Honey Infused Sea Salt', 'Handmade Raspberry Lemonade',
    'Gourmet White Truffle Olive Oil', 'Smoked Salmon and Creme Fraiche Blinis',
    'Sourdough Baguette with Herbed Goat Cheese', 'Cinnamon Sugar Dusted Donut Holes',
    'Crafted Jalapeno and Cilantro Guacamole', 'Mint Chocolate Chip Artisan Ice Cream',
    'Organic Acai Berry Smoothie Mix', 'Artisanal Blueberry Almond Granola',
    'Hand-Rolled Pumpkin Spice Truffles', 'Gourmet Blackberry Basil Lemonade',
    'Crafted Coconut and Lime Margarita Mixer', 'Hand-Picked Strawberry Rhubarb Pie',
    'Smoked Paprika and Rosemary Roasted Almonds', 'Sustainably Caught Swordfish Steaks',
    'Lemon Ginger Infused Sparkling Kombucha', 'Handcrafted Caramel Apple Slices',
    'Organic Hibiscus Berry Herbal Tea', 'Artisanal Cherrywood Smoked Bacon',
    'Handmade Cinnamon Swirl Bread', 'Crafted Mango Passionfruit Sorbet',
    'Locally Sourced Lavender Honey Cheesecake', 'Crispy Salted Caramel Popcorn'
])
additional_food_beverages_names = np.array([
    'Spicy Jalapeño Salsa', 'Mango Coconut Smoothie', 'Crispy Parmesan Kale Chips'
])
food_beverages_names = np.concatenate([food_beverages_names, additional_food_beverages_names])

In [32]:
electronic_accessories_names = np.array([
    'Wireless Bluetooth Earbuds', 'Slim Laptop Cooling Pad', 'Portable Power Bank Charger',
    'Universal Laptop Docking Station', 'Wireless Charging Pad', 'Smartphone Camera Lens Kit',
    'Adjustable Laptop Stand', 'Noise-Canceling Headphones', 'Gaming Mouse and Keyboard Combo',
    'Smartwatch with Fitness Tracker', 'HD Webcam with Microphone', 'Wireless Ergonomic Mouse',
    'Bluetooth Mechanical Keyboard', 'External Hard Drive Enclosure', 'High-Speed HDMI Cable',
    'USB-C Hub with Ethernet Port', 'Multi-Port USB Wall Charger', 'Compact Wireless Mouse',
    'Bluetooth In-Ear Sport Headphones', 'Wireless Charging Desk Lamp', 'Foldable Bluetooth Keyboard',
    'Gaming Headset with RGB Lighting', 'USB Desk Fan with Adjustable Speed', 'Smart Home Security Camera',
    'Qi Wireless Charging Stand', 'Laptop Sleeve with Shockproof Padding', 'Touchscreen Stylus Pen',
    'Gaming Controller for PC and Console', 'Noise-Isolating In-Ear Earphones', 'Portable Bluetooth Speaker',
    'Smart Plug with Voice Control', 'Laptop Backpack with USB Charging Port', 'Mechanical Gaming Keyboard',
    'Wireless Presenter with Laser Pointer', 'Adjustable Tablet Stand Holder', 'Bluetooth Audio Receiver Adapter',
    'Anti-Theft Laptop Backpack', 'RGB Gaming Mouse Pad', 'External SSD Drive', 'USB-C to HDMI Adapter',
    'Over-Ear Bluetooth Headphones', 'Compact Travel Power Strip', 'RGB Mechanical Gaming Mouse',
    'Bluetooth Car Kit with FM Transmitter', 'Laptop Cooling Stand with RGB Lights', 'Wireless Optical Mouse',
    'Universal Laptop Sleeve', 'Bluetooth Wireless Barcode Scanner', 'Desktop Cable Organizer',
    'Digital Drawing Tablet with Pen', 'Wireless Numeric Keypad', 'Noise-Canceling Bluetooth Earphones',
    'Smartphone Tripod with Remote', 'Foldable Laptop Desk with Cooling Fan', 'USB LED Desk Lamp',
    'Wireless Charging Mouse Pad', 'Gaming Mouse Pad with RGB Lights', 'USB-C to USB Adapter',
    'Bluetooth Wireless Game Controller', 'Noise-Canceling Bluetooth Headset', 'Smart LED Light Bulb',
    'Laptop Lock with Key', 'Portable Bluetooth Karaoke Microphone', 'Wireless Charging Car Mount',
    'Wireless Touchpad Keyboard', 'USB Microphone for Streaming', 'Adjustable Monitor Stand',
    'Bluetooth Receiver for Home Stereo', 'Gaming Chair with Lumbar Support', 'Portable External CD/DVD Drive',
    'USB-C Laptop Charger', 'Mechanical Gaming Keypad', 'Wireless Presentation Clicker',
    'Universal Travel Adapter', 'Gaming Laptop Cooling Pad', 'Bluetooth FM Transmitter for Car',
    'Portable Folding Bluetooth Keyboard', 'Smart WiFi Power Strip', 'Wireless Vertical Ergonomic Mouse',
    'Wireless Charging Mouse', 'USB Desk Grommet Charger', 'Gaming Mouse Pad with Wireless Charger',
    'Noise-Canceling Bluetooth Sleep Mask', 'Adjustable Laptop Table', 'Wireless Mechanical Gaming Keyboard',
    'Gaming Headset Stand with RGB Lights', 'USB-C External GPU Enclosure', 'RGB LED Strip Lights',
    'Bluetooth Gamepad for Mobile', 'Wireless Car Charger Mount', 'USB-C Docking Station',
    'Laptop Cooling Pad with RGB Lights', 'Wireless Bluetooth Adapter for Headphones', 'Portable Mini Projector',
    'Smart LED Strip Lights', 'Mechanical Gaming Keypad', 'Bluetooth Audio Transmitter Receiver',
    'Adjustable Dual Monitor Stand', 'Portable Photo Printer', 'Wireless Charging Desk Organizer',
    'RGB Backlit Gaming Mouse', 'Wireless Mechanical Gaming Mouse', 'Bluetooth Wireless Sport Earphones',
    'Portable Bluetooth Turntable', 'USB-C External SSD', 'Gaming Headset Stand with USB Hub',
    'Wireless Charging Alarm Clock', 'Gaming Laptop Backpack', 'Smartphone Gimbal Stabilizer',
    'RGB LED Gaming Desk', 'Noise-Canceling Bluetooth Sleeping Headphones', 'Wireless Charging Table Lamp',
    'Portable Bluetooth Barcode Scanner', 'USB-C to Ethernet Adapter', 'Gaming Desk Chair with Footrest',
    'Foldable Laptop Cooling Pad', 'Bluetooth Karaoke Machine', 'Wireless Charging Desk Clock',
    'Wireless Mechanical Gaming Keyboard', 'USB Powered Desk Fan', 'Noise-Canceling Bluetooth Neckband Headphones',
    'Bluetooth Wireless Gamepad Controller', 'USB-C Magnetic Laptop Charger', 'Smart WiFi Doorbell Camera',
    'Wireless Bluetooth Foldable Headphones', 'USB-C to SD Card Reader', 'Gaming Mouse Pad with Wireless Charging',
    'Wireless Touchpad Mouse', 'Bluetooth Wireless Folding Keyboard', 'Wireless Charging Bedside Lamp',
    'Gaming Keyboard and Mouse Combo', 'RGB Gaming Headset Stand', 'Portable Laptop Desk with Mouse Pad',
    'Wireless Charging Car Cup Holder', 'Smartphone and Tablet Stand', 'Bluetooth Wireless Foldable Mouse'
])
additional_electronic_accessories_names = np.array([
    'Wireless Charging Pad', 'Bluetooth Earbuds', 'Foldable Phone Stand', 'RGB Gaming Mouse',
    'Smartphone Camera Lens Kit', 'USB-C Hub Adapter', 'Noise Cancelling Headphones', 'Portable Bluetooth Speaker',
    'Wireless Keyboard and Mouse Set', 'Fitness Tracker Watch', '360-Degree Phone Holder', 'Gaming Laptop Cooling Pad',
    'Smart Home Security Camera', 'Foldable Solar Charger', 'Digital Drawing Tablet', 'Smart Plug with Alexa',
    'Wireless Charging Mouse Pad', 'Bluetooth Karaoke Microphone', 'Adjustable Laptop Stand', 'Fitness Smart Scale',
    'USB-C Power Bank', 'Wireless Sport Earphones', 'LED Desk Lamp with Wireless Charger', 'HD Webcam with Microphone',
    'Bluetooth FM Transmitter', 'Gaming Keyboard and Mouse Combo', 'Portable Power Inverter', 'Smartphone Tripod Stand',
    'External SSD Drive', 'Wireless Presenter Remote', 'Smart LED Light Strip', '3D Virtual Reality Headset'
])

electronic_accessories_names = np.concatenate([electronic_accessories_names, additional_electronic_accessories_names])

In [33]:
sports_travel_names = np.array([
    'Premium Hiking Backpack', 'Collapsible Water Bottle', 'Sports Armband for Phone',
    'Travel Neck Pillow', 'Hydration Running Belt', 'Portable Camping Stove',
    'Insulated Stainless Steel Water Bottle', 'Compression Socks for Travel', 'Foldable Travel Duffel Bag',
    'Trekking Poles with Anti-Shock Mechanism', 'Travel Packing Cubes Set', 'Camping Hammock with Mosquito Net',
    'Sweat-Wicking Athletic Headband', 'Polarized Sports Sunglasses', 'Ultralight Camping Chair',
    'Expandable Luggage Organizer', 'Trail Running Shoes', 'Compact Travel Umbrella',
    'Resistance Band Set for Exercise', 'Inflatable Travel Pillow', 'Running Waist Pack',
    'Outdoor Waterproof Hiking Boots', 'Travel Size Toiletry Bottles Set', 'Folding Camp Table',
    'Quick Dry Microfiber Towel', 'Multi-Function Camping Lantern', 'Portable First Aid Kit',
    'Adjustable Compression Knee Brace', 'Camping Sleeping Bag', 'Travel Adapter Plug Set',
    'Sports Water Bottle with Straw', 'Foldable Running Hat', 'Lightweight Backpacking Tent',
    'Travel Money Belt', 'Insulated Cooler Backpack', 'Collapsible Silicone Travel Cup',
    'Compact Camping Cookware Set', 'Portable Outdoor Grill', 'Running Shoe Insoles',
    'Anti-Theft Travel Backpack', 'TSA Approved Luggage Locks', 'Compact Folding Beach Chair',
    'Outdoor Portable Bluetooth Speaker', 'Sports Hydration Pack', 'Travel Laundry Bag',
    'Compact Binoculars for Travel', 'Portable Camping Coffee Maker', 'Inflatable Kayak',
    'Cycling Hydration Pack', 'Travel Size Foam Roller', 'Camping Cookware Mess Kit',
    'Collapsible Silicone Water Bottle', 'Compact Travel Pillow', 'Hiking Trail Map and Compass',
    'Compression Arm Sleeves', 'Lightweight Backpacking Stove', 'Travel Document Organizer',
    'Insulated Picnic Cooler Tote', 'Running Belt with Water Bottles', 'Travel Size Toiletry Kit',
    'Outdoor Portable Folding Table', 'Camping Headlamp with Red Light', 'Portable Solar Charger',
    'Portable Folding Beach Mat', 'Hydration Running Vest', 'Travel Packing Checklist Journal',
    'Sports Compression Shorts', 'Outdoor Portable Grill', 'Collapsible Trekking Pole',
    'Ultralight Inflatable Sleeping Pad', 'Portable Camping Shower', 'Camping Cookware Set',
    'Cycling Repair Tool Kit', 'Travel Size Shampoo and Conditioner Set', 'Camping Tent Fan',
    'Sports Compression Arm Sleeves', 'Portable Power Inverter for Car', 'Hiking Gaiters',
    'Travel Size Toothbrush and Toothpaste Set', 'Compact Beach Umbrella', 'Running Hydration Belt',
    'Portable Outdoor Water Filter', 'Foldable Travel Yoga Mat', 'Camping Hammock with Tree Straps',
    'Sports Headband and Wristband Set', 'Travel Size Deodorant Stick', 'Outdoor Emergency Survival Kit',
    'Inflatable Camping Pillow', 'Collapsible Camping Lantern', 'Travel Size Sunscreen Lotion',
    'Portable Camping Tableware Set', 'Outdoor Adventure Binoculars', 'Ultralight Camping Cookware',
    'Running Safety Lights', 'Portable Campfire Stove', 'Travel Size Folding Hair Dryer',
    'Camping Folding Shovel', 'Sports Water Jug with Handle', 'Foldable Travel Guitar',
    'Travel Size Makeup Remover Wipes', 'Camping Portable Espresso Maker', 'Lightweight Travel Backpack',
    'Portable Camping Pot and Pan Set', 'Inflatable Travel Foot Rest Pillow', 'Sports Resistance Bands',
    'Travel Size Hand Sanitizer Gel', 'Collapsible Camping Cup', 'Outdoor Portable Mosquito Repellent',
    'Running Reflective Vest', 'Portable Campfire Grill', 'Camping Cookware Utensil Set',
    'Travel Size Laundry Detergent Sheets', 'Sports Knee Support Brace', 'Portable Camping Lantern Fan',
    'Inflatable Stand-Up Paddle Board', 'Travel Size Facial Tissue Packs', 'Outdoor Portable Stove',
    'Running Hydration Backpack', 'Compact Binoculars with Night Vision', 'Collapsible Trekking Pole',
    'Travel Size Sewing Kit', 'Camping Portable Water Filter', 'Portable Solar Shower Bag',
    'Cycling Helmet with LED Lights', 'Sports Ankle Brace', 'Inflatable Travel Lumbar Pillow',
    'Travel Size Foldable Hair Brush', 'Camping Portable Water Kettle', 'Outdoor Portable Bluetooth Speaker',
    'Running Hydration Belt with Bottles', 'Compact Travel Clothesline', 'Collapsible Camping Bowl',
    'Sports Cooling Towel', 'Portable Camping Grill', 'Travel Size Folding Hair Straightener',
    'Camping Portable Water Purifier', 'Inflatable Travel Pillow for Kids', 'Cycling Bike Repair Kit',
    'Travel Size Folding Hair Comb', 'Sports Resistance Loop Bands', 'Collapsible Camping Plate',
    'Portable Camping Espresso Maker', 'Outdoor Portable Folding Chair', 'Running GPS Watch'
])
additional_sports_travel_names = np.array([
    'Compact Travel Umbrella', 'Trail Running Shoes', 'Collapsible Water Bottle', 'Compression Socks',
    'Portable Camping Stove', 'Resistance Band Set', 'Travel Neck Pillow', 'Insulated Water Bottle',
    'Foldable Hiking Backpack', 'Adjustable Jump Rope', 'Compact Binoculars', 'Hydration Waist Pack',
    'Inflatable Camping Pillow', 'Outdoor Waterproof Blanket', 'Rolling Duffel Bag', 'Collapsible Trekking Poles',
    'Travel Organizer Cubes', 'Quick Dry Microfiber Towel', 'Running Hydration Belt', 'Compact Sleeping Bag', 'Portable Outdoor Hammock'
])
sports_travel_names = np.concatenate([sports_travel_names, additional_sports_travel_names])

In [34]:
home_lifestyle_names = np.array([
    'Smart Home Security System', 'Aromatherapy Essential Oil Diffuser', 'Decorative Throw Pillow Covers',
    'Adjustable Bedside Table Lamp', 'Memory Foam Neck Support Pillow', 'Modern Wall Clock',
    'Faux Fur Area Rug', 'Stainless Steel Kitchen Utensil Set', 'Linen Tablecloth with Fringe',
    'Wooden Floating Wall Shelves', 'Ceramic Plant Pot Set', 'Velvet Accent Chair',
    'Digital Meat Thermometer', 'Vintage Edison Bulb String Lights', 'Soft Microfiber Bed Sheets',
    'Wall-Mounted Floating Bookshelf', 'Marble Coasters Set', 'Luxe Velvet Throw Blanket',
    'Wireless Charging Desk Organizer', 'Rechargeable Handheld Vacuum Cleaner', 'Hydroponic Indoor Garden Kit',
    'Soy Wax Scented Candles Set', 'Cotton Bath Towel Set', 'Minimalist Ceramic Dinnerware Set',
    'Metallic Finish Bedside Table', 'Smart Wi-Fi Thermostat', 'Artificial Potted Plants',
    'Adjustable Height Swivel Bar Stools', 'Stainless Steel French Press', 'Modern Glass Coffee Table',
    'Digital Bathroom Scale', 'Organic Cotton Bedding Set', 'Floating Wall-Mounted TV Console',
    'Premium Stainless Steel Cookware Set', 'Velvet Upholstered Bed Frame', 'Rustic Wooden Wall Mirror',
    'LED Flameless Candles Set', 'Acrylic Makeup Organizer', 'Wooden Cutting Board Set',
    'Contemporary Upholstered Dining Chairs', 'Glass Food Storage Containers', 'Wireless Smart Bulb Kit',
    'Wall-Mounted Vertical Garden Planter', 'Electric Wine Opener Set', 'Reversible Outdoor Hammock',
    'Cotton Velvet Pillow Covers', 'Smart Wi-Fi Video Doorbell', 'Bamboo Fiber Dinnerware Set',
    'Memory Foam Bath Mat', 'Modern Floor Lamp', 'Ceramic Cozy Mug Set', 'Portable Bluetooth Speaker System',
    'Marble Top Side Table', 'Smart Plug Socket Set', 'Faux Leather Storage Ottoman',
    'Stainless Steel Kitchen Canister Set', 'Woven Cotton Throw Blanket', 'Adjustable Desk Organizer',
    'Digital Kitchen Food Scale', 'Hybrid Memory Foam Mattress', 'LED Vanity Mirror with Lights',
    'Adjustable Swivel Desk Chair', 'Decorative Glass Vase Set', 'Quilted Velvet Bedspread Set',
    'Smart Wi-Fi Smart Thermostat', 'Faux Sheepskin Area Rug', 'Rechargeable Handheld Milk Frother',
    'Eco-Friendly Bamboo Cutting Board', 'Outdoor Solar Garden Lights', 'Soft Velvet Lumbar Pillow',
    'Wireless Charging Pad with Desk Organizer', 'Cotton Linen Throw Pillow Set', 'Smart Voice Assistant Speaker',
    'Modern Floating TV Stand', 'Stainless Steel Insulated Tumbler Set', 'Minimalist Bedside Table',
    'Digital Meat and Cooking Thermometer', 'Wooden Floating Wall Cube Shelves', 'Ceramic Succulent Planters',
    'Adjustable Standing Desk Converter', 'Smart Wi-Fi Plug Socket Set', 'Velvet Swivel Bar Stools',
    'Sleek Glass Teapot Set', 'LED Desk Lamp with Wireless Charger', 'Cotton Muslin Swaddle Blanket Set',
    'Wireless Bluetooth Soundbar', 'Faux Marble Coaster Set', 'Rechargeable Handheld Cordless Vacuum',
    'Indoor Herb Garden Starter Kit', 'Aromatherapy Scented Candle Set', 'Stainless Steel Kitchen Knife Set',
    'Minimalist Upholstered Platform Bed', 'Wooden Wall-Mounted Coat Rack', 'LED Flameless Candle Lanterns',
    'Acrylic Makeup Brush Holder', 'Bamboo Bed Tray with Folding Legs', 'Memory Foam Lumbar Support Cushion',
    'Smart Wi-Fi Light Bulb Kit', 'Velvet Upholstered Dining Chairs', 'Rustic Wooden Wall Shelf',
    'LED Flameless Candle Set with Remote', 'Compact Stainless Steel Ice Maker', 'Adjustable Window Blackout Curtains',
    'Modern Glass Teapot Set', 'Cotton Velvet Dining Chair Covers', 'Wireless Charging Bedside Table',
    'Digital Kitchen Timer', 'Hydroponic Indoor Herb Garden Kit', 'Soy Wax Scented Candle Gift Set',
    'Glass Food Storage Jar Set', 'Adjustable LED Floor Lamp', 'Ceramic Tea Mug with Infuser',
    'Marble Coasters with Gold Edges', 'Smart Wi-Fi Smart Plug Socket Set', 'Faux Leather Storage Bench',
    'Stainless Steel Kitchen Utensil Holder', 'Woven Cotton Blanket Throw', 'Modern Glass Coffee Table with Storage',
    'Digital Kitchen Food Thermometer', 'Organic Cotton Bedding Sheet Set', 'Floating Wall-Mounted Media Console',
    'Premium Stainless Steel Cookware Pot Set', 'Velvet Upholstered Ottoman', 'Rustic Wooden Wall Clock',
    'LED Flameless Candles with Remote', 'Acrylic Jewelry Organizer', 'Bamboo Cutting Board with Juice Groove',
    'Memory Foam Neck Pillow with Cooling Gel', 'Smart Wi-Fi Video Doorbell Kit', 'Artificial Potted Plants Set',
    'Adjustable Height Swivel Bar Stools Set', 'Stainless Steel French Press Coffee Maker', 'Modern Glass Coffee Table Set',
    'Digital Bathroom Scale with Body Fat Analyzer', 'Organic Cotton Bedding Sheet Set', 'Floating Wall-Mounted TV Console',
    'Premium Stainless Steel Cookware Pot Set', 'Velvet Upholstered Ottoman', 'Rustic Wooden Wall Clock',
    'LED Flameless Candles with Remote', 'Acrylic Jewelry Organizer', 'Bamboo Cutting Board with Juice Groove',
    'Memory Foam Neck Pillow with Cooling Gel', 'Smart Wi-Fi Video Doorbell Kit', 'Artificial Potted Plants Set',
    'Adjustable Height Swivel Bar Stools Set', 'Stainless Steel French Press Coffee Maker', 'Modern Glass Coffee Table Set',
    'Digital Bathroom Scale with Body Fat Analyzer', 'Organic Cotton Bedding Sheet Set', 'Floating Wall-Mounted TV Console',
    'Premium Stainless Steel Cookware Pot Set', 'Velvet Upholstered Ottoman', 'Rustic Wooden Wall Clock',
    'LED Flameless Candles with Remote', 'Acrylic Jewelry Organizer', 'Bamboo Cutting Board with Juice Groove',
    'Memory Foam Neck Pillow with Cooling Gel'
])

In [35]:
health_beauty_names = np.array([
    'Radiant Glow Vitamin C Serum', 'Revitalizing Aloe Vera Shampoo', 'Soothing Lavender Body Lotion',
    'Hydrating Coconut Oil Hair Mask', 'Refreshing Green Tea Facial Cleanser', 'Anti-Aging Retinol Night Cream',
    'Nourishing Argan Oil Hair Serum', 'Natural Tea Tree Acne Treatment', 'Moisture Surge Hyaluronic Acid Cream',
    'Exfoliating Charcoal Face Scrub', 'Whitening Activated Charcoal Toothpaste', 'Calming Chamomile Eye Cream',
    'Essential Lavender Aromatherapy Oil', 'Collagen Boosting Peptide Powder', 'Gentle Micellar Water Makeup Remover',
    'Soothing Aloe Vera After Sun Gel', 'Detoxifying Dead Sea Mud Mask', 'Volumizing Biotin Shampoo',
    'Balancing Rose Water Facial Toner', 'Jojoba Oil for Skin and Hair', 'Repairing Avocado Hair Mask',
    'Energizing Eucalyptus Shower Gel', 'Foot Spa Epsom Salt Soak', 'Moisturizing Shea Butter Body Butter',
    'Revitalizing Charcoal Body Scrub', 'Cooling Aloe Vera Gel Patch', 'Anti-Dandruff Tea Tree Shampoo',
    'Cleansing Tea Tree Face Wipes', 'Vitamin E Nourishing Oil', 'Relaxing Lavender Body Wash',
    'Organic Castor Oil for Eyelashes', 'Calming Chamomile Bath Bombs', 'Invigorating Peppermint Roll-On',
    'Moisturizing Hemp Seed Oil Body Lotion', 'Rosemary Mint Scalp Treatment', 'Anti-Cellulite Massage Oil',
    'Soothing Lavender Sleep Spray', 'Vitamin C Brightening Mask', 'Cruelty-Free Vegan Lip Balm',
    'Caffeine Infused Under Eye Cream', 'Moisturizing Argan Oil Hand Cream', 'Exfoliating Himalayan Salt Scrub',
    'Natural Hair Growth Serum', 'Tea Tree Oil Foot and Nail Cream', 'Hydrating Coconut Water Sheet Mask',
    'Vitamin E Cuticle Oil', 'Activated Charcoal Teeth Whitening Kit', 'Alcohol-Free Witch Hazel Toner',
    'Sulfate-Free Argan Oil Shampoo', 'Energizing Peppermint Body Wash', 'Organic Tea Tree Deodorant',
    'Salicylic Acid Acne Cleanser', 'Vitamin C Daily Moisturizer', 'Soothing Lavender Bath Salts',
    'Jojoba Oil Hair Mask', 'Cucumber Mint Body Mist', 'Coconut Milk and Honey Bath Soak',
    'Retinol Anti-Wrinkle Night Cream', 'Green Tea Face Scrub', 'Hyaluronic Acid Eye Cream',
    'Eucalyptus Mint Shower Gel', 'Coconut Oil Pulling Kit', 'Lavender Botanical Shampoo',
    'Argan Oil Deep Conditioning Hair Mask', 'Tea Tree Oil Blemish Stick', 'Coffee Body Scrub',
    'Aloe Vera Gel Eye Mask', 'Peptide Infused Face Serum', 'Gentle Lavender Shampoo',
    'Revitalizing Hair Growth Mask', 'Cucumber Aloe Vera Face Mist', 'Exfoliating Walnut Scrub',
    'Natural Hair Repair Serum', 'Tea Tree Oil Antifungal Cream', 'Soothing Lavender Pillow Spray',
    'Biotin Hair Growth Shampoo', 'Vitamin C Serum with Hyaluronic Acid', 'Jojoba Oil Face Cleanser',
    'Moisturizing Avocado Eye Cream', 'Calming Chamomile Bath Tea', 'Sandalwood Aromatherapy Diffuser Oil',
    'Radiant Skin Brightening Mask', 'Tea Tree Oil Hand Sanitizer', 'Refreshing Aloe Vera Face Toner',
    'Exfoliating Charcoal Soap Bar', 'Hemp Seed Oil Scalp Treatment', 'Cucumber Mint Cooling Gel',
    'Argan Oil Leave-In Hair Conditioner', 'Peppermint Lip Balm', 'Cocoa Butter Body Cream',
    'Vitamin E Infused Lip Scrub', 'Soothing Lavender Body Oil', 'Organic Coconut Oil Makeup Remover',
    'Tea Tree Oil Shaving Cream', 'Rosehip Oil Anti-Aging Serum', 'Gentle Chamomile Baby Shampoo',
    'Hyaluronic Acid Lip Plumping Balm', 'Coconut Milk Bath Bomb', 'Jojoba Oil Makeup Remover Wipes',
    'Activated Charcoal Peel-Off Mask', 'Aloe Vera Gel Eye Drops', 'Peptide Infused Neck Cream',
    'Lavender Chamomile Sleep Balm', 'Vitamin C Brightening Eye Cream', 'Cucumber Mint Cooling Face Mask',
    'Argan Oil Anti-Frizz Hair Serum', 'Tea Tree Oil Body Wash', 'Coffee Infused Eye Cream',
    'Aloe Vera Cooling Gel Pads', 'Peppermint Foot Soak', 'Cocoa Butter Stretch Mark Cream',
    'Vitamin E Hydrating Face Mist', 'Soothing Lavender Massage Oil', 'Organic Coconut Oil Body Wash',
    'Tea Tree Oil Foot Scrub', 'Rosehip Oil Moisturizing Lip Balm', 'Gentle Chamomile Face Cleanser',
    'Hyaluronic Acid Hydrating Serum', 'Coconut Milk Detox Bath Salts', 'Jojoba Oil Hair Growth Shampoo',
    'Activated Charcoal Teeth Whitening Pen', 'Aloe Vera Gel Foot Cream', 'Peptide Infused Night Cream',
    'Lavender Chamomile Bath Oil', 'Vitamin C Brightening Face Scrub', 'Cucumber Mint Refreshing Face Mist',
    'Argan Oil Hair Repair Mask', 'Tea Tree Oil Body Lotion', 'Coffee Infused Body Scrub',
    'Aloe Vera Gel Sunscreen SPF 30', 'Peppermint Cooling Foot Cream', 'Cocoa Butter Body Oil',
    'Vitamin E Nourishing Cuticle Cream', 'Soothing Lavender Body Butter', 'Organic Coconut Oil Hair Serum',
    'Tea Tree Oil Acne Spot Treatment', 'Rosehip Oil Hydrating Face Mask', 'Gentle Chamomile Baby Lotion'
])
additional_health_beauty_names = np.array([
    'Rosewater Infused Toner', 'Detoxifying Clay Face Mask', 'Volumizing Mascara', 'Silk Sleep Cap',
    'Jade Roller Facial Massager', 'Collagen Boosting Eye Cream', 'Exfoliating Foot Scrub', 'Vitamin C Body Serum',
    'Scented Bath Bombs Set', 'Microblading Eyebrow Pen', 'Hyaluronic Acid Lip Mask', 'Aromatherapy Shower Steamers',
    'Glow-Boosting Face Oil', 'Cuticle Repair Serum'
])
health_beauty_names = np.concatenate([health_beauty_names, additional_health_beauty_names])

In [36]:
merged_array = np.concatenate([fashion_accessories_names, electronic_accessories_names, sports_travel_names, home_lifestyle_names, health_beauty_names, food_beverages_names])
len(merged_array)

993

In [37]:
unique_combinations['product_names'] = np.concatenate([
    electronic_accessories_names,
    fashion_accessories_names,
    food_beverages_names,
    health_beauty_names,
    home_lifestyle_names,
    sports_travel_names
])
unique_combinations

,product_line,unit_price,product_id,product_names
0,Electronic accessories,63.22,1,Wireless Bluetooth Earbuds
1,Electronic accessories,83.08,2,Slim Laptop Cooling Pad
2,Electronic accessories,20.85,3,Portable Power Bank Charger
3,Electronic accessories,52.89,4,Universal Laptop Docking Station
4,Electronic accessories,74.51,5,Wireless Charging Pad
...,...,...,...,...
988,Sports and travel,23.01,989,Travel Organizer Cubes
989,Sports and travel,83.06,990,Quick Dry Microfiber Towel
990,Sports and travel,48.91,991,Running Hydration Belt
991,Sports and travel,37.02,992,Compact Sleeping Bag
992,Sports and travel,29.61,993,Portable Outdoor Hammock

In [38]:
df_product = pd.merge(unique_combinations, df_product_line, left_on='product_line', right_on='product_line_name', how='outer')
df_product = df_product[['product_id', 'product_names', 'unit_price', 'product_line_id']]
df_product.rename(columns={'product_names': 'product_name', 'product_line': 'product_line_id'}, inplace=True)

df_product

     product_id                      product_name  unit_price  product_line_id
0             1        Wireless Bluetooth Earbuds       63.22                2
1             2           Slim Laptop Cooling Pad       83.08                2
2             3       Portable Power Bank Charger       20.85                2
3             4  Universal Laptop Docking Station       52.89                2
4             5             Wireless Charging Pad       74.51                2
..          ...                               ...         ...              ...
988         989            Travel Organizer Cubes       23.01                4
989         990        Quick Dry Microfiber Towel       83.06                4
990         991            Running Hydration Belt       48.91                4
991         992              Compact Sleeping Bag       37.02                4
992         993          Portable Outdoor Hammock       29.61                4

[993 rows x 4 columns]

In [39]:
# Insert extracted data into departments table

table_name = "product"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

df_product.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

993

### Table - Payment_type

In [40]:
supermarket.rename(columns={'Payment': 'payment_type'}, inplace=True)

In [41]:
unique_payment_type = supermarket['payment_type'].unique()
payment_type_df = pd.DataFrame({
    'payment_type_id': range(1, len(unique_payment_type) + 1),
    'payment_type': unique_payment_type
})
payment_type_df

   payment_type_id payment_type
0                1      Ewallet
1                2         Cash
2                3  Credit card

In [42]:
# Insert extracted data into departments table

table_name = "payment_type"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

payment_type_df.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

3

### Table - invoice

In [43]:
supermarket.rename(columns={'Tax 5%': 'tax', 'gross income': 'gross_income', 'Invoice ID': 'invoice_id', 'Total': 'total_sale', 'cogs':'cost_of_sold'}, inplace=True)

In [44]:
invoice_df = supermarket[['invoice_id', 'total_sale', 'tax', 'cost_of_sold', 'gross_income', 'payment_type']].drop_duplicates()
invoice_df

      invoice_id  total_sale      tax  cost_of_sold  gross_income payment_type
0    750-67-8428    548.9715  26.1415        522.83       26.1415      Ewallet
1    226-31-3081     80.2200   3.8200         76.40        3.8200         Cash
2    631-41-3108    340.5255  16.2155        324.31       16.2155  Credit card
3    123-19-1176    489.0480  23.2880        465.76       23.2880      Ewallet
4    373-73-7910    634.3785  30.2085        604.17       30.2085      Ewallet
..           ...         ...      ...           ...           ...          ...
995  233-67-5758     42.3675   2.0175         40.35        2.0175      Ewallet
996  303-96-2227   1022.4900  48.6900        973.80       48.6900      Ewallet
997  727-02-1313     33.4320   1.5920         31.84        1.5920         Cash
998  347-56-2442     69.1110   3.2910         65.82        3.2910         Cash
999  849-09-3807    649.2990  30.9190        618.38       30.9190         Cash

[1000 rows x 6 columns]

In [45]:
#Merge 'invoice_df' on the 'payment_type_df' table
invoice_df = pd.merge(invoice_df, payment_type_df, left_on='payment_type', right_on='payment_type', how='outer')[['invoice_id', 'total_sale', 'tax', 'cost_of_sold', 'gross_income', 'payment_type_id']]
invoice_df

,invoice_id,total_sale,tax,cost_of_sold,gross_income,payment_type_id
0,750-67-8428,548.9715,26.1415,522.83,26.1415,1
1,123-19-1176,489.0480,23.2880,465.76,23.2880,1
2,373-73-7910,634.3785,30.2085,604.17,30.2085,1
3,699-14-3026,627.6165,29.8865,597.73,29.8865,1
4,355-53-5943,433.6920,20.6520,413.04,20.6520,1
...,...,...,...,...,...,...
995,156-20-0370,26.7225,1.2725,25.45,1.2725,3
996,151-33-7434,71.1585,3.3885,67.77,3.3885,3
997,552-44-5977,520.8000,24.8000,496.00,24.8000,3
998,430-53-4718,633.1080,30.1480,602.96,30.1480,3
999,886-18-2897,296.9400,14.1400,282.80,14.1400,3

In [46]:
# Insert extracted data into departments table

table_name = "invoice"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

invoice_df.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

1000

### Table Invoice_by_day

In [47]:
supermarket.rename(columns={'Date': 'date', 'Time': 'time'}, inplace=True)
invoice_by_day_df = supermarket[['date', 'time', 'invoice_id']].drop_duplicates()
invoice_by_day_df['date'] = pd.to_datetime(invoice_by_day_df['date'], format='%m/%d/%Y')
invoice_by_day_df['time'] = pd.to_datetime(invoice_by_day_df['time'], format='%H:%M').dt.time
invoice_by_day_df

          date      time   invoice_id
0   2019-01-05  13:08:00  750-67-8428
1   2019-03-08  10:29:00  226-31-3081
2   2019-03-03  13:23:00  631-41-3108
3   2019-01-27  20:33:00  123-19-1176
4   2019-02-08  10:37:00  373-73-7910
..         ...       ...          ...
995 2019-01-29  13:46:00  233-67-5758
996 2019-03-02  17:16:00  303-96-2227
997 2019-02-09  13:22:00  727-02-1313
998 2019-02-22  15:33:00  347-56-2442
999 2019-02-18  13:28:00  849-09-3807

[1000 rows x 3 columns]

In [48]:
# Insert extracted data into departments table

table_name = "invoice_by_day"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

invoice_by_day_df.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

1000

### Table - daily_Sales

In [49]:
day_sell_df = supermarket[['date', 'total_sale', 'cost_of_sold', 'tax', 'gross_income']].drop_duplicates()
day_sell_df.rename(columns={'total_sale': 'net_purchases', 'cost_of_sold': 'gross_sale', 'tax': 'tax_of_sell', 'gross_income': 'margin'}, inplace=True)
day_sell_df

          date  net_purchases  gross_sale  tax_of_sell   margin
0     1/5/2019       548.9715      522.83      26.1415  26.1415
1     3/8/2019        80.2200       76.40       3.8200   3.8200
2     3/3/2019       340.5255      324.31      16.2155  16.2155
3    1/27/2019       489.0480      465.76      23.2880  23.2880
4     2/8/2019       634.3785      604.17      30.2085  30.2085
..         ...            ...         ...          ...      ...
995  1/29/2019        42.3675       40.35       2.0175   2.0175
996   3/2/2019      1022.4900      973.80      48.6900  48.6900
997   2/9/2019        33.4320       31.84       1.5920   1.5920
998  2/22/2019        69.1110       65.82       3.2910   3.2910
999  2/18/2019       649.2990      618.38      30.9190  30.9190

[1000 rows x 5 columns]

In [50]:
#Find duplicate date on day_sell_df
day_sell_df['date'] = pd.to_datetime(day_sell_df['date'])  # Convert the 'date' column to datetime format
duplicates = day_sell_df[day_sell_df.duplicated('date')]

if duplicates.empty:
    print("No duplicate dates found.")
else:
    print("Duplicate dates found:\n", duplicates)

Duplicate dates found:
           date  net_purchases  gross_sale  tax_of_sell   margin
19  2019-03-11        84.6300       80.60       4.0300   4.0300
20  2019-02-25       451.7100      430.20      21.5100  21.5100
26  2019-02-08        35.1960       33.52       1.6760   1.6760
29  2019-03-15       235.2105      224.01      11.2005  11.2005
30  2019-02-25       494.1825      470.65      23.5325  23.5325
..         ...            ...         ...          ...      ...
995 2019-01-29        42.3675       40.35       2.0175   2.0175
996 2019-03-02      1022.4900      973.80      48.6900  48.6900
997 2019-02-09        33.4320       31.84       1.5920   1.5920
998 2019-02-22        69.1110       65.82       3.2910   3.2910
999 2019-02-18       649.2990      618.38      30.9190  30.9190

[911 rows x 5 columns]

In [51]:
#Aggregate dataframe by day
aggregated_day_sell_df = day_sell_df.groupby('date').agg({
    'net_purchases': 'sum',
    'gross_sale': 'sum',
    'tax_of_sell': 'sum',
    'margin': 'sum'
    }).reset_index()

#Print the aggregated Dataframe
print(aggregated_day_sell_df)

         date  net_purchases  gross_sale  tax_of_sell    margin
0  2019-01-01      4745.1810     4519.22     225.9610  225.9610
1  2019-01-02      1945.5030     1852.86      92.6430   92.6430
2  2019-01-03      2078.1285     1979.17      98.9585   98.9585
3  2019-01-04      1623.6885     1546.37      77.3185   77.3185
4  2019-01-05      3536.6835     3368.27     168.4135  168.4135
..        ...            ...         ...          ...       ...
84 2019-03-26      1962.5130     1869.06      93.4530   93.4530
85 2019-03-27      2902.8195     2764.59     138.2295  138.2295
86 2019-03-28      2229.4020     2123.24     106.1620  106.1620
87 2019-03-29      4023.2430     3831.66     191.5830  191.5830
88 2019-03-30      4487.0595     4273.39     213.6695  213.6695

[89 rows x 5 columns]

In [52]:
aggregated_day_sell_df = pd.DataFrame(aggregated_day_sell_df)
aggregated_day_sell_df

         date  net_purchases  gross_sale  tax_of_sell    margin
0  2019-01-01      4745.1810     4519.22     225.9610  225.9610
1  2019-01-02      1945.5030     1852.86      92.6430   92.6430
2  2019-01-03      2078.1285     1979.17      98.9585   98.9585
3  2019-01-04      1623.6885     1546.37      77.3185   77.3185
4  2019-01-05      3536.6835     3368.27     168.4135  168.4135
..        ...            ...         ...          ...       ...
84 2019-03-26      1962.5130     1869.06      93.4530   93.4530
85 2019-03-27      2902.8195     2764.59     138.2295  138.2295
86 2019-03-28      2229.4020     2123.24     106.1620  106.1620
87 2019-03-29      4023.2430     3831.66     191.5830  191.5830
88 2019-03-30      4487.0595     4273.39     213.6695  213.6695

[89 rows x 5 columns]

In [53]:
# Insert extracted data into departments table

table_name = "daily_sales"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

aggregated_day_sell_df.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

89

### Table - invoice product relationship

In [54]:
df_invoice_product_relationship = pd.merge(unique_combinations, supermarket, on=['product_line', 'unit_price'], how='outer')
df_invoice_product_relationship.rename(columns={'Invoice ID': 'invoice_id', 'Quantity': 'quantity'}, inplace=True)
df_invoice_product_relationship = df_invoice_product_relationship[['invoice_id', 'product_id', 'quantity']]
df_invoice_product_relationship

      invoice_id  product_id  quantity
0    556-97-7101           1         2
1    219-61-4139           2         1
2    733-33-4967           3         8
3    608-27-6295           4         6
4    366-43-6862           4         4
..           ...         ...       ...
995  751-15-6198         989         6
996  730-50-9884         990         7
997  360-39-5055         991         5
998  554-53-3790         992         6
999  891-58-8335         993         7

[1000 rows x 3 columns]

In [55]:
# Insert extracted data into departments table

table_name = "invoice_product_relationship"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

df_invoice_product_relationship.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

1000

### Table - invoice_relation

In [56]:
temp_IR_df = invoice_df

In [57]:
#Generating random customer_ids and store_ids
np.random.seed(42)  # Setting seed for reproducibility
temp_IR_df['customer_id'] = np.random.randint(1, 2001, size=len(temp_IR_df))
temp_IR_df['store_id'] = np.random.randint(1, 151, size=len(temp_IR_df))

temp_IR_df

,invoice_id,total_sale,tax,cost_of_sold,gross_income,payment_type_id,customer_id,store_id
0,750-67-8428,548.9715,26.1415,522.83,26.1415,1,1127,10
1,123-19-1176,489.0480,23.2880,465.76,23.2880,1,1460,56
2,373-73-7910,634.3785,30.2085,604.17,30.2085,1,861,30
3,699-14-3026,627.6165,29.8865,597.73,29.8865,1,1295,109
4,355-53-5943,433.6920,20.6520,413.04,20.6520,1,1131,5
...,...,...,...,...,...,...,...,...
995,156-20-0370,26.7225,1.2725,25.45,1.2725,3,1618,94
996,151-33-7434,71.1585,3.3885,67.77,3.3885,3,883,24
997,552-44-5977,520.8000,24.8000,496.00,24.8000,3,256,148
998,430-53-4718,633.1080,30.1480,602.96,30.1480,3,709,37
999,886-18-2897,296.9400,14.1400,282.80,14.1400,3,1839,4

In [58]:
invoice_relations_df = temp_IR_df[['invoice_id', 'customer_id', 'store_id']]
invoice_relations_df

      invoice_id  customer_id  store_id
0    750-67-8428         1127        10
1    123-19-1176         1460        56
2    373-73-7910          861        30
3    699-14-3026         1295       109
4    355-53-5943         1131         5
..           ...          ...       ...
995  156-20-0370         1618        94
996  151-33-7434          883        24
997  552-44-5977          256       148
998  430-53-4718          709        37
999  886-18-2897         1839         4

[1000 rows x 3 columns]

In [59]:
# Insert extracted data into departments table

table_name = "invoice_relation"

# Delete the contents in the table before appending new data if any

with engine.connect() as connection:
    connection.execute(f"DELETE FROM {table_name}")

invoice_relations_df.to_sql(
    table_name,
    engine,
    if_exists='append',
    index=False
)

1000

In [60]:
engine.dispose()